Repository: CofficLab/Lumi
Catalog: Plugins/EditorPanelPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Edit the content in the editor area and save the file.
zh_hans: 在编辑区修改内容并保存文件。
zh_hk: 在編輯區修改內容並儲存檔案。

source: Editor area
zh_hans: 编辑区
zh_hk: 編輯區

source: Editor area: shows the content of the open file for viewing and editing.
zh_hans: 编辑区:显示已打开文件的内容,供查看与编辑。
zh_hk: 編輯區:顯示已開啟檔案的內容,供查看與編輯。

source: Editor service unavailable
zh_hans: 编辑器服务不可用
zh_hk: 编辑器服务不可用

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面佈局

source: File sidebar
zh_hans: 文件侧边栏
zh_hk: 檔案側邊欄

source: File sidebar: the list of files in the current project; click a file to open it.
zh_hans: 文件侧边栏:当前项目的文件列表;点击文件即可打开。
zh_hk: 檔案側邊欄:目前專案的檔案列表;點擊檔案即可開啟。

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: Open a project in the app.
zh_hans: 在应用中打开一个项目。
zh_hk: 在應用程式中開啟一個專案。

source: Overview
zh_hans: 概述
zh_hk: 概述

source: Project
zh_hans: 项目
zh_hk: 專案

source: Select a file in the file sidebar to open it in the editor.
zh_hans: 在文件侧边栏中选择文件,在编辑器中打开。
zh_hk: 在檔案側邊欄中選擇檔案,在編輯器中開啟。

source: The editor is available in the rail, the chat, and the panel areas.
zh_hans: 编辑器可在侧栏、聊天与面板区域中使用。
zh_hk: 編輯器可在側欄、聊天與面板區域中使用。

source: The editor is provided by the system; if it shows Editor service unavailable, enable the editor-related plugins and restart the app.
zh_hans: 编辑器由系统提供;若显示「编辑器服务不可用」,请启用编辑器相关插件并重启应用。
zh_hk: 編輯器由系統提供;若顯示「編輯器服務不可用」,請啟用編輯器相關外掛並重新啟動應用程式。

source: This manual covers the interface and basic operations of the built-in Code Editor: browsing and editing project files.
zh_hans: 本手册介绍内置代码编辑器的界面与基本操作:浏览与编辑项目文件。
zh_hk: 本手冊介紹內建程式碼編輯器的介面與基本操作:瀏覽與編輯專案檔案。

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Code Editor
zh_hans: 代码编辑器

source: Display the content of the current project file.
zh_hans: 显示当前项目文件的内容。
